In [1]:
import pandas as pd

In [2]:
a = [1,3,5]

In [3]:
my_series = pd.Series(a, index = ["a","f","k"])

In [4]:
print(my_series)

a    1
f    3
k    5
dtype: int64

In [5]:
data =  [['Kashvi',20,'Surat'],
        ['Daksh',21,'Surat'],
        ['Riya',23,'Surat']]
df = pd.DataFrame(data, columns = ['Name','Age','City'])
df

     Name  Age   City
0  Kashvi   20  Surat
1   Daksh   21  Surat
2    Riya   23  Surat

In [14]:
df.loc[0]

Name    Kashvi
Age         20
City     Surat
Name: 0, dtype: object

In [9]:
df['Name']

0    Kashvi
1     Daksh
2      Riya
Name: Name, dtype: object

In [10]:
# Create 3 list viz.productid, ProductName, Product price with 5 elements each. Add this element to create a dataframe

data = [[101, 'Ramen',60],
       [102, 'Biscuits',35],
       [103,'Dark Chocolate',50],
       [104,'Maggie',20],
       [105,'Butter Milk',25]]
df = pd.DataFrame(data, columns = ['productid','ProductName','Product Price'])
df

   productid     ProductName  Product Price
0        101           Ramen             60
1        102        Biscuits             35
2        103  Dark Chocolate             50
3        104          Maggie             20
4        105     Butter Milk             25

In [11]:
# Extarct one by one column and display separately from above dataframe
df['productid']

0    101
1    102
2    103
3    104
4    105
Name: productid, dtype: int64

In [12]:
df['ProductName']

0             Ramen
1          Biscuits
2    Dark Chocolate
3            Maggie
4       Butter Milk
Name: ProductName, dtype: object

In [13]:
df['Product Price']

0    60
1    35
2    50
3    20
4    25
Name: Product Price, dtype: int64

In [14]:
# Display separately each and every row from an above dataframe.(use loc or iloc function)
df.loc[1]

productid             102
ProductName      Biscuits
Product Price          35
Name: 1, dtype: object

In [15]:
df.loc[2]

productid                   103
ProductName      Dark Chocolate
Product Price                50
Name: 2, dtype: object

In [16]:
df.loc[3]

productid           104
ProductName      Maggie
Product Price        20
Name: 3, dtype: object

In [17]:
df.loc[4]

productid                105
ProductName      Butter Milk
Product Price             25
Name: 4, dtype: object

In [18]:
df.loc[0]

productid          101
ProductName      Ramen
Product Price       60
Name: 0, dtype: object

In [19]:
# Display a data name from 3 rows using loc function
df.loc[[2,3,4],['Product Price']]

   Product Price
2             50
3             20
4             25

In [20]:
# Display price located in 2 row using iloc function.
df.loc[[0,2],['Product Price']]

   Product Price
0             60
2             50

In [20]:
#display 2 nd 4 row data excluding price
df.loc[[1,2,3],['productid','ProductName']]

   productid     ProductName
1        102        Biscuits
2        103  Dark Chocolate
3        104          Maggie

In [21]:
#Display 1 to 3rd row price data only
df.loc[[0,1,2],['Product Price']]

   Product Price
0             60
1             35
2             50

In [22]:
#Change marks in Maths column to 41 for students who have scored less than 40
data = [[1,'Kashvi',90,85,95],
        [2,'Riya',80,90,85],
        [3,'Nandini',80,90,85],
        [4,'Daksh',39,85,95],
        [5,'Kathan',15,76,60]]

kd=pd.DataFrame(data, columns = ['ID','STUDENT NAME','Maths','English','Science'])
kd

   ID STUDENT NAME  Maths  English  Science
0   1       Kashvi     90       85       95
1   2         Riya     80       90       85
2   3      Nandini     80       90       85
3   4        Daksh     39       85       95
4   5       Kathan     15       76       60

In [23]:
#change marks in maths column to 41 for students who have scored less than 40
marks=kd['Maths']<40
kd.loc[marks,'Maths']=41
kd

   ID STUDENT NAME  Maths  English  Science
0   1       Kashvi     90       85       95
1   2         Riya     80       90       85
2   3      Nandini     80       90       85
3   4        Daksh     41       85       95
4   5       Kathan     41       76       60

In [24]:
#add 2 marks to all the subjects marks. If any of the marks exceeds 100 change it to 100



# Display studennts who have scored more than 50 marks in Maths and kore than 60 mrks in science

In [25]:
kd = pd.read_csv('salaries.csv')
kd

C:\Users\dell\AppData\Local\Temp\ipykernel_18872\2999175568.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  kd = pd.read_csv('salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [26]:
kd.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [27]:
kd.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [28]:
kd.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [29]:
kd.shape

(148654, 13)

In [33]:
# to find information of data set
kd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [34]:
kd['BasePay']

0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object

In [35]:
kd['BasePay'].mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object>

In [ ]:
#ffill : forward filling

In [1]:
import pandas as pd